# Trabajar con Numpy

In [1]:
import numpy as np
import pandas as pd

Crear un __array__ de numpy

In [3]:
lis1 = [1,2,3,4,5]
arrnp1 = np.array(lis1)
print(type(lis1))
print(type(arrnp1))

<class 'list'>
<class 'numpy.ndarray'>

Buscar elementos en el array

In [11]:
print(arrnp1[0])
print(arrnp1[0:2])
print(arrnp1[[0,2,4]])

1
[1 2]
[1 3 5]

Ejemplo de array de __2 dimensiones__

In [12]:
arrnp2 = np.array([[0, 1, 2], [3, 4, 5]]) # array 2 x 3
print(type(arrnp2))
arrnp2b = arrnp2.reshape(6) # con reshape se redimensiona
arrnp2c = arrnp2.reshape(3,2)
arrnp2, arrnp2b, arrnp2c

<class 'numpy.ndarray'>

(array([[0, 1, 2],
        [3, 4, 5]]), array([0, 1, 2, 3, 4, 5]), array([[0, 1],
        [2, 3],
        [4, 5]]))

Crear un array con un __rango__

In [13]:
arrnp3 = np.arange(10)
arrnp3

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

Obtener __estadísticos__ sumas, valores medios ,desviación estándar, suma acumulada, máximo y mínimo

In [14]:
arrnp3.sum()

45

In [15]:
arrnp3.mean()

4.5

In [16]:
arrnp3.std()

2.8722813232690143

In [17]:
arrnp3.max()

9

In [18]:
arrnp3.min()

0

In [19]:
arrnp3.cumsum()

array([ 0,  1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

Operaciones __aritméticas__ con array

In [8]:
arrnp4 = np.array([10,11,12])
arrnp5 = np.array([3,10,6])

# operaciones aritméticas (elemento a elemento)
res1 = arrnp4 - arrnp5
res2 = arrnp4 + arrnp5
res3 = arrnp4*arrnp5
res4 = arrnp4*3
print(res1)
print(res2)
print(res3)
print(res4)

[7 1 6]
[13 21 18]
[ 30 110  72]
[30 33 36]

__Conversión__ de __tipos__

In [9]:
# Conversión de tipos
lis = arrnp4.tolist()  # paso a lista
arrstr = arrnp4.tostring() # paso a string
lis, arrstr

([10, 11, 12], b'\n\x00\x00\x00\x0b\x00\x00\x00\x0c\x00\x00\x00')

Pasar de dataframe a array de numpy

In [22]:
#pasar de df a array numpy
clientes = {'nombre': ['Jorge', 'Luis', 'Pilar', 'Ana'],
            'edad': [33, 25, 44, 37],
            'ciudad': ['Valladolid', 'Madrid', 'Madrid', 'Cuenca']   
            }

df_clientes = pd.DataFrame(clientes)
arrdf = df_clientes.values
arrdf, type(arrdf)

(array([['Jorge', 33, 'Valladolid'],
        ['Luis', 25, 'Madrid'],
        ['Pilar', 44, 'Madrid'],
        ['Ana', 37, 'Cuenca']], dtype=object), numpy.ndarray)

Paso de numpy array a df

In [23]:
# pasar de array numpy a df
df_clientes2 = pd.DataFrame(arrdf, columns = ['nombre', 'edad', 'ciudad'])
df_clientes2

  nombre edad      ciudad
0  Jorge   33  Valladolid
1   Luis   25      Madrid
2  Pilar   44      Madrid
3    Ana   37      Cuenca

In [24]:
arrnp4, arrnp5

(array([10, 11, 12]), array([ 3, 10,  6]))

In [11]:
arrnp6 = np.concatenate([arrnp4, arrnp5])
arrnp6

array([10, 11, 12,  3, 10,  6])

__Añadir__ elementos a un array

In [12]:
# añadir elemento al final (append)
arrnp6 = np.append(arrnp6, 20)
arrnp6

array([10, 11, 12,  3, 10,  6, 20])

In [27]:
# Añadimos el elemento 200 al array en el  puesto del índice 5
arrnp6 = np.insert(arrnp6, 5, 200)
arrnp6

array([ 10,  11,  12,   3,  10, 200,   6,  20])

__Condicionales__

Método __where__: numpy.where(condición, valor en True, valor en False)

In [13]:
# filtros
res4 = arrnp6[ arrnp6 > 10]
res4

array([11, 12, 20])

Filtros múltiples __logical_and__ y __logical_or__

In [24]:
res5 = arrnp6[np.logical_and(arrnp6 > 10, arrnp6 < 20)]
res5

array([11, 12])

In [14]:
arrnp6

array([10, 11, 12,  3, 10,  6, 20])

In [31]:
arrnp7 = np.where(arrnp6 >= 20, "S", "N")
arrnp7

array(['N', 'N', 'N', 'N', 'N', 'S', 'N', 'S'], dtype='<U1')

In [11]:
l_clientes = [['JVG', 100, 'Valladolid'],
              ['LMN', 80, 'Madrid'],
              ['PAB', 45, 'Zaragoza'],
              ['ATC', 115, 'Cuenca']] 
df_clientes = pd.DataFrame(l_clientes, 
   columns=['nombre', 'factura', 'ciudad'])
df_clientes

  nombre  factura      ciudad
0    JVG      100  Valladolid
1    LMN       80      Madrid
2    PAB       45    Zaragoza
3    ATC      115      Cuenca

In [13]:
df_clientes['valor'] = np.where(df_clientes['factura']>=100, "alto", "bajo")
df_clientes

  nombre  factura      ciudad valor
0    JVG      100  Valladolid  alto
1    LMN       80      Madrid  bajo
2    PAB       45    Zaragoza  bajo
3    ATC      115      Cuenca  alto

Condicional método __select__ : numpy.select(lista condiciones, lista valores, default)

In [5]:
arrnp6 =np.arange(20)

In [7]:
arrnp8 = np.select([arrnp6<=10, arrnp6 <= 15, arrnp6 > 15], ['A', 'B', 'C']) 
arrnp8

array(['A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'B', 'B',
       'B', 'B', 'B', 'C', 'C', 'C', 'C'], dtype='<U11')

In [15]:
df_clientes['valor2'] = np.select([df_clientes['factura'] <= 50, df_clientes['factura'] <= 80, df_clientes['factura'] >= 100 ]
                                  , ["bajo", "medio", "alto"])
df_clientes

  nombre  factura      ciudad valor valor2
0    JVG      100  Valladolid  alto   alto
1    LMN       80      Madrid  bajo  medio
2    PAB       45    Zaragoza  bajo   bajo
3    ATC      115      Cuenca  alto   alto

Diferencia entre dos arrays

In [2]:
lis1 = [1,2,3,4,5]
lis2 = [1,2,3,4,6]
arrnp1 = np.array(lis1)
arrnp2 = np.array(lis2)

In [4]:
res = np.isin(arrnp1, arrnp2)
res

array([ True,  True,  True,  True, False])

In [5]:
all(res)

False

In [6]:
any(res)

True

In [7]:
clientes = {'cod_cliente': ['001', '002', '005', '007'],
            'P1': [1, 1, 1, 0],
            'P2': [1, 1, 1, 1]
            }

df_clientes = pd.DataFrame(clientes)
# El df toma como nombres de las columnas los campos del diccionario
print(type(df_clientes))
df_clientes

<class 'pandas.core.frame.DataFrame'>

  cod_cliente  P1  P2
0         001   1   1
1         002   1   1
2         005   1   1
3         007   0   1

In [8]:
res = np.isin(df_clientes['P1'],df_clientes['P2'])
res

array([ True,  True,  True, False])

In [9]:
all(res)

False

In [10]:
any(res)

True

In [12]:
df_clientes[res] #muestra las filas iguales

  cod_cliente  P1  P2
0         001   1   1
1         002   1   1
2         005   1   1

In [13]:
df_clientes[~res] #muestra las filas con diferencias

  cod_cliente  P1  P2
3         007   0   1

In [15]:
#reemplazo
df_clientes.loc[~res,'P1'] = 1
df_clientes

  cod_cliente  P1  P2
0         001   1   1
1         002   1   1
2         005   1   1
3         007   1   1

Calculo __matricial__

In [23]:
# Calculo matricial
arr1 = np.array([[1,2,3], [4,5,6], [7,8,9]])
mat1 = np.mat(arr1) 
print(type(mat1))
mat1

<class 'numpy.matrixlib.defmatrix.matrix'>

matrix([[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]])

Pasar de array a __fichero__

In [24]:
np.savetxt("ficheros\\outnp.txt",arrnp6)

In [25]:
# formatear como entero
np.savetxt("ficheros\\outnp.txt",arrnp6,fmt='%i')

In [26]:
arrnp7 = np.loadtxt("ficheros\\outnp.txt", dtype=np.int64)

In [27]:
arrnp7

array([ 10.,  11.,  12.,   3.,  10., 200.,   6.,  20.])

In [4]:
arrnp = np.array([1,2,3,4,5,6])
arrnp

array([1, 2, 3, 4, 5, 6])